{
    "730": [
        {
            "review": "Alright, I've been playing CS since 1.6. I know CS:GO had a rough first year after release, but CS2 really is something else. As someone that used to do tournaments and events with a team as a former semi-pro back in the day, this game has steered so far to terrible that it's just not worth wasting time on until it's in a proper playable state. It's a shell of what once was one of the most optimised FPS's out there and many other current pro players and former pro players will tell you the same thing. If you have a ping above 20, forget about it. The glitches, the cheaters, the lack of network utilisation, the lack of support for content creators, the deceit etc.. There's just so much wrong with this game right now. This review may change later, but I'm dead sick of trying to enjoy it as it once was. Perhaps it's my fault for moving over to Starlink, perhaps I'm getting old, or perhaps the years beforehand were my imagination, but no, it's not the case because others have the exact same issues and it seems Valve has turned a blind eye to them.",
            "weighted_vote_score": "0.864976644515991211"
        },
        {
            "review": "CounterStrike: Where the only thing more reliable than your terrible aim is the endless cheaters spinning around like they’re auditioning for Dancing with the Stars. You’ll learn real fast that the only thing more accurate than your gunshots are the cheaters aimbots, which somehow always seem to have perfect aim. But hey, at least you’ll get to experience the sweet, sweet thrill of a game where everything looks fine until you die in 0.1 seconds to someone who’s clearly not from this dimension. But don’t worry, Valve’s totally on it. I’m sure they’re working hard on that anti cheat system. Any day now. In the meantime, enjoy getting headshot by a guy who’s both floating and twerking through the map.\n10/10 would totaly throw my keyboard across the room again.",
            "weighted_vote_score": "0.892233848571777344"
        },
        {
            "review": "fantastic game. Just needs to work on, cheating, movement, matchmaking, networking, community maps, cheating, anti-cheat, maps that have been gone for years. cheating. and add back signatures to trade ups",
            "weighted_vote_score": "0.799447238445281982"
        },
        {
            "review": "Never start playing this game! It's like a toxic relationship: spend money, get mad and aggressive, quit, and then come right back to repeat the cycle once again because you cling to that one or two happy memories you've had with the game.\n\nJust buy Animal Crossing or Minecraft or something. That sh*t is actually good for your mental health.",
            "weighted_vote_score": "0.696473956108093262"
        },
        {
            "review": "Spend Hundreds by Accident, You are Always Best Player and its Always teams fault that you lost or ping. Its definetly not your 300 damage in whole match. You are Always enjoying to play with Russian players, and they enjoy playing with Polish players. You are shooting head but not even touching him even if his whole head moved and blood came out. Sometimes you even not hitting him at all but it counts as headshots. Well its physics haha. Enjoy your day!\r\n\r\n10/10",
            "weighted_vote_score": "0.686638295650482178"
        },
        {
            "review": "I'll try to keep the salt out of this one: \r\n\r\nFirst of all. I've been playing Counter Strike since the age of bulky PC monitors. Bulky as dishwashers. And mice had balls in them (no pun intended). I always loved the competition. \r\n\r\nHackers: \r\nThere are way too many hackers around. While they are getting kicked at casual games, they are NOT getting kicked at competetive/premier games. Throwing a game because a hacker is in your team does not happen. At all! \r\n\r\nConnection: \r\nI pay top money to get high speed / low ping (4ms) connection. However this seems to be completely useless in CS2. When playing against bad pings (80ms and more), you do not win most of your peaks and sometimes even die before you can spot the enemy. Frustrating to say the least. And maybe proof, that the tick-system does not work. \r\n\r\nAll in all, I am disappointed to say that Counter Strike is broken.",
            "weighted_vote_score": "0.659045219421386719"
        },
        {
            "review": "Too many wall hack cheaters!!!!!!!!! The game is nice and all but its not really nice when u get into a match with wallhackers. There has to be a good anti cheat out there!!!!",
            "weighted_vote_score": "0.600651860237121582"
        },
        {
            "review": "Full of cheaters, Anti-Cheat doesn't work, Not Optimized, full of bugs,The mechanics are faulty and many more.... .\nBring Back CS:GO. It doesn't worth it to play.",
            "weighted_vote_score": "0.580152690410614014"
        },
        {
            "review": "A good game, but due to a bad anti-cheat, it is impossible to play it((",
            "weighted_vote_score": "0.56204378604888916"
        },
        {
            "review": "I cant recommend CSGO2.... The amount of cheaters in every game... even casuals, makes the whole experience a big NO NO... Wallhackers, aimbots, its impossible to have fun.",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "CS2? More like CSPOO 🤮\n\n     CS2 is a terrible direct replacement of CS:GO. It still doesn't have many of the maps and gamemodes that CS:GO had, and it's been a year since it's disastrous release. For the maps, all they'd have to do is port them overrr WTFF. I don't care if the maps still have CS:GO graphics, I and many others just want to play them again. 😭 The main thing they've been focusing on in the very few updates since release has been further monetization, they barely give a fuck about making the game as good as CS:GO was, even though they killed CS:GO (their masterpiece) to overwrite it with CS2, the very rushed supposed \"newer and better\" version of CS:GO. All they did was make the game prettier, but that barely matters when there is only a few of the maps and gamemodes from before, and the gameplay is worse. AND ALL THE HUNDREDS OF UNIQUE STEAM ACHIEVEMENTS FROM CS:GO ARE GONEEE. ALL THE ONES I SPENT HOURS GRINDING, WTF NEW VALVE. And Valve holding off fixing the bot problem in TF2 that had been plaguing the game for more than five years until finally only a couple months ago when the community made a petition with over 340 thousand people signing it is so shitty, I think they're forgetting they're a game company. Do they even care about their games at this point? If so, barely. I can go on for much longer yapping about their blatant laziness and lack of care for their own games and their respective communities. Screw what Valve has become, MAKE COUNTER-STRIKE GREAT AGAIN.\n     I was actually so hyped for Counter-Strike 2's release, I loved Valve, but then I realized CS2 was dogshit and that Valve doesn't give a fuck about their games anymore. Replacing one of their greatest masterpieces with a massive downgrade in every aspect other than the graphics, smh.\n     CS:GO was what I fell in love with, not whatever this is. My favorite gamemode, Flying Scoutsman... I won't forget you. Great job Valve 👏 great job fumbling this shit on a level no one has seen before, except maybe with Overwatch 2. I will never forget the hell of a time I've had playing CS:GO, my favorite FPS game. Thank you Valve for giving me the chance to meet so many other hilarious and goated people playing the game that I loved most. But please, don't forget to think about your community and listen to us. I truly believe CS:GO was better than Valorant, but CS2 is most definitely not. For Christ's sake bring CS:GO back, and if you don't, maybe consider bringing back all the features that CS:GO had before you start adding a ton more paid cosmetics, that's basically all you've done in the past year of updates. Why'd you have to force everyone from CS:GO to switch to CS2, CS:GO was a meticulously crafted game that was still owned by you, so why didn't you let people continue playing CS:GO and just make CS2 it's own separate game? Then people could've continued enjoying CS:GO and feeding you money while you get CS2 in a more acceptable and complete state, worthy enough for more people to then switch over from CS:GO to CS2. You've never directly replaced your games with a sequel like this before, why did you do that now when it's clearly a terribly poor decision. You could've just make CS2 a separate game and when someone unlocks cosmetics in CS:GO, it'd also unlocks them in CS2, and you could have CS2 exclusive cosmetics. Please stop killing your games along with your reputation Valve. Don't just make Counter-Strike great again, make Valve great again. Gotta say, Valve you're killing it with the VR gear and the Steam Deck, but could you please show your games a little more love? They deserve it, and we do too. Love your new \"Major Update\" on November 13th btw, so glad to finally see only one of the many classic maps left behind added back from CS:GO into CS2, what a major update thanks :) Took more than a full year but that's okay. One map returning is such great progress. And thanks for all the community maps as well, I know it's very difficult to re-release all of your own maps, thank god for the community mappers still making some actual content for you to release :D Maybe you should start hiring them again like you used to do way back when? Could help to fix and finish your game you know, just a suggestion. \"We're happy to announce the return of the momentarily lost classic, Train.\" Wow, \"momentarily lost\" is a year in your eyes. Crazy. Valve time sure is real. We gonna start a #FixCS2? Guess it should be more of a #FinishCS2. Come on now, this game is seriously lacking in content, especially when compared to CS:GO, the game you replaced with this shit. Now I'm just repeating myself. Yap session over.",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "Estoy SUPER harto de tratar de disfrutar el juego, pero es injugable de muchas formas, si querés tomarte el subir de rango seriamente en cualquiera de los competitivos tenés que perder incontables horas de vida siendo rehén de fracasados que deciden activar cheats.\nEl juego sigue presentando bugs después de un año de haber salido, cada vez hay menos eventos y contenido real que motive a invertir tiempo en el juego (EN PREMIER SIGUE LA CONDENADA TEMPORADA 1!!)\nLa armería es una movida más que solo ofrece rentabilidad a la empresa y una pésima opción como inversión.\n\nEsta reseña va dirigida a sus desarolladores que no hacen una pizca por la comunidad y solo agregan pura mierda monetizable. Espero tener que arrepentirme de esta reseña por cambios positivos en el juego, lo cual a esta altura dudo mucho que pase.",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "The game has become better mechanically, if compared with cs:go. However, the huge number of cheaters that occur every second game in the premier mode and competitive mode darken the overall impression and do not allow you to fully enjoy the game. Overall 5/10",
            "weighted_vote_score": "0.543726265430450439"
        },
        {
            "review": "Bring Back VAC. CS:GO was a true gem, CS2 update turned this game into a cash grab and a frustration to play anymore.",
            "weighted_vote_score": "0.593545317649841309"
        },
        {
            "review": "full of cheaters on new accounts even with prime enabled. no spin botters since they updated server side detection more wallers and aimbot with magic bullet has been infesting comp.",
            "weighted_vote_score": "0.539384007453918457"
        },
        {
            "review": "if you want to have fun then dont ever play this fucking game. It's full of cheaters for a 10+ years game. it's just sooooooooooo bad broooooooooooooooooo. what is the use of the report button really. I want to know. Its useless.",
            "weighted_vote_score": "0.586983740329742432"
        },
        {
            "review": "This game used to bee so good, im talking abt cs1.6 and csgo, cs2 is a complete failure, except for graphics, they are really good, but hitboxes and bullets suck, hopefully they will fix this game for once.",
            "weighted_vote_score": "0.536702275276184082"
        },
        {
            "review": "Valve clearly doesn't give a damn about players. As long as cheaters will buy armory passes, they won't fix the anticheat system. Fk you valve. You're just a bunch of jews",
            "weighted_vote_score": "0.53271031379699707"
        },
        {
            "review": "I have never had a worse experience than playing this game. The solo queuing is horrendous and the ranking system is broken beyond repair. I went from 17000+ elo and dropped to 5.5k and have no chance of climbing back as my teammates have an IQ lower than the cockroaches that roam their rooms. Please turn the original counter strike global offensive servers on. I have valve and their anti cheat system and their ability to make fun mulitplayer games. I hope that every person working on this game finds a new job and that the game shuts down.",
            "weighted_vote_score": "0.580191612243652344"
        },
        {
            "review": "The previous game was much better than this. 128 tick servers for matchmaking and a better anti-cheat was the only things that players wanted but they came up with legs and 3D smokes. awful shooting, awful movement, awful game.",
            "weighted_vote_score": "0.528122007846832275"
        },
        {
            "review": "Ranking system is not worth playing also they took off fun map in rank yes the game look a little bit better but they change it too much",
            "weighted_vote_score": "0.526184558868408203"
        },
        {
            "review": "This game use to run great...... use to. \n\nValve let people play csgo without having to install it as a beta wasting 80gb.",
            "weighted_vote_score": "0.524169206619262695"
        },
        {
            "review": "Niggas can't appreciate real art anymore without dick inna booty ass niggas saying bullshit",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "I don't know how you expect new people to play the game if they start off with low trust factors. Every COMPETITIVE LOW ELO game I get into has cheaters. This game needs a better anti-cheat",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "So many hackers, played the same one twice on Premier, thanks for the 1000 MMR loss so my team could forfeit quicker. So many hackers, trash game.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "its lets anyone at any age gamble so its amazing i love to gamble whenever im not wnning big i feel like die. also like shooter or something idk",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "A Great Game Stifled by Cheaters and Underwhelming Updates\n\nCounter-Strike 2 offers thrilling FPS action with tight gunplay and competitive gameplay, but cheaters have become a major issue, ruining the experience for honest players. The game’s anti-cheat system struggles to keep up, leading to frustrating encounters with aimbots and wallhackers. This undermines the integrity of the competitive scene and drives many players away.\n\nThe recent Armory update, meant to breathe new life into the game, falls flat. Instead of delivering meaningful content, it feels like a shallow cash grab with overpriced skins and little to no impactful gameplay changes. The updates increasingly prioritize monetization over player experience, making it harder for dedicated fans to stay invested in a game that’s losing its charm. The game's potential is still there, but the cheater problem and disappointing updates are slowly ruining it.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Its just a money making simulator for the devs. The original oldschool Counterstrike 1.6 is way better than CS 2.\nThey took the original good maps and changed them and now they are mostly garbage ( a few exceptions like dust 2 and inferno ) and they dont even have all the maps in CS 2 ready. Cant recommend CS 2 and never will\n",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Nah man the brain rot you get is immaculate plus a loads of hackers in matchmaking. The game is fun to play but if you really wanna play you can play on faceit servers much better.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "I really want to love this game but the ranking system for premier is awful. The absolute worse system to try and climb a competitive ladder. It does not feel like it takes in YOUR individual skill just how many games you lose or win. So even when I preform better than my team the game for some reason give me a bigger penalty in points over the course of several games. Also if you ever take a week off there goes half your rating",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "This game is life, this game is pain, its just like ur penis, sometimes its up and sometimes its down. Have fun",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "hate this fkng game i open the game to play some game but everydamnt time im regretting  ,WHY there are  bunch of  lifeless russian guys in enemy team, even in FUCKNG NOVA ELO\nwhy am i playing against global in nove elo, its almost impossible to rank up in this fkng game    unless u have smurf guy or cheater in your team\ni absoltely not recommending this shitty game(except case )  jst play 3 or 4 game a week to get your case",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "shit game but im gonna play it anyway fucking playing wingman trying to rank up wining 8 games in a row (the game not ranking me up )then fucking 5 times in a row playing against cheaters with b-hops aim hack and wall hack losing to the cheaters then the game rank down me i realy dont want to play anymore but i will play dont be stupid like me stop playing this shit game goodluck.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Every single update manages to reduce your fps by 30-40 while bringing nothing good to the game, don’t even bother if you don’t have a nasa computer",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Good game!  But not always. There are lot of cheaters:( (sometimes)  But for me really good game!",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "The best game to ever exist. I went to school, opened my backpack and placed my laptop on the table. Then I went on to play a shooter named cs2. My teacher started screaming at me for me to stop playing around, so I peeked at him as he was running through the hall. I started shooting, didnt hit a single shot. The hitboxes are actually something, you hit the head 20 times and it doesnt count. Then theres a teammate yelling in russian while youre trying to clutch. You look at him as he kills you and laughs. Train is back btw. The enemy has around 15k hours while your mates dont know how to walk. They bump into walls and call you bad. Would recommend!",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "This Game Is Genuinely Terrible And Utterly Miserable To Play.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "It's gets worse over time.\nCS2 just runs worse and worse after each update.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "\nThe game has had a cheating problem for a year now, and instead of Valve improving the anti-cheat system, they're adding skins because they don't care about the game, they only care about the money. \n\n\n\n\n",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Love the game, its an improvement from the last and fun with other players ;)",
            "weighted_vote_score": "0.523809552192687988"
        }
    ],
    "440": [
        {
            "review": "I'm an old player. I've played for around 1000 hours since 2016. Im not that old but i have very fond memories of TF2. I was very young back then. Valve has made something unique, something that is almost akin to a rite of passage for a proper gamer. It's one of the few games that still lets you do almost anything you want, for better or for worse. \n\nI am so happy and proud to have been part of the community. It's the most dedicated one i have ever witnessed, most likely on par with the communities of Lord of the Rings and the like. Valve used to care about the game, and Gaben himself did, once. Even if they don't now, you can see it in it's soul that it has love baked into the code itself. \n\nPlay tf2. And you wont be able to play anything else for a while. For me, it was 7 years until i was done. But the youtube videos, the sfms, the \"meet the team\".... THEY show what tf2 is about. The community. I personally seriously got into tf2 when i saw meet the pyro, late 2015.",
            "weighted_vote_score": "0.760135769844055176"
        },
        {
            "review": "4 thousand hours sunk into it. Its a great game and i wish i could have experienced it around 2009 to 2015 at its golden age. It may not be the golden age but i will still be playing as long as the servers are open. 20 anniversary is approaching and i cannot wait to see what they come up with.",
            "weighted_vote_score": "0.603524267673492432"
        },
        {
            "review": "It is a very good game with the right people. Everyday you will meet new people and sometimes even ones you may have seen before and everyday is a new experience awaiting, could be good or bad but in the end, its team fortress 2.",
            "weighted_vote_score": "0.565217375755310059"
        },
        {
            "review": "Will leave you screaming at your monitor and frothing at the mouth over autobalance stacking the enemy team with atleast 3 dominations each, meanwhile your team is comprised of people who dropped out of preschool.\n\n10/10 would recommend",
            "weighted_vote_score": "0.546218514442443848"
        },
        {
            "review": "Cool game. community is as strong as ever and even though i have 900+ hrs right now i still haven't mastered everything this game has to offer.",
            "weighted_vote_score": "0.54356849193572998"
        },
        {
            "review": "a good game, but comp is a joke as much as casual and also no updates with new weapons for years!",
            "weighted_vote_score": "0.483004391193389893"
        },
        {
            "review": "This still gets updates so I'm voting this game for Labor of Love as I think Valve does still care of old games judging by the fact they did something about the bot issue in tf2 :)",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Ha llegado la hora de clasificar objetivamente esta bazofia.\nGráficos: Para 1993 son inmejorables, 10 puntos\nJugabilidad: A pesar de que a veces el submarino es mas lento que un río de mierda, esta muy bien medida, 9.5\nMúsica: Quizá el único punto débil del juego, si es que un 8 se le puede considerar punto débil, 8.0\nPresentación: 10, nuevamente, para la época era muy buena\nTotal: 0, 0 PUNTOS, ES MÁS, NI SIQUIERA 0, NADA, MATERIA OSCURA, ESTE JUEGO NO LO MERECE Y NO SE LO RECOMIENDO A NADIE\nSentencia: Amputación\nBuenas noches a todos.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "I like this game thats why i play this, but no, i dont recommend this game f or new players, ill tell my reasons why:\n\n1. Valve abandoned this game for years and it got infested with bots, hackers, griefers-harassers and the majority of them got away with what they did, ruined peoples games and wasted their time, and they didnt get banned, punished, witch-hunted and jeered at. Some of them are still out there still doing it and left unpunished.\nValve ban & punish those hackers, bot hosters and griefers.\n\n2. Random Crits, it maybe \"funny\" or \"satisfying\" the first or second time but after that its not, when you get them its not because it wasnt your skill, experience, thinking, performance that got you those kills it was just a cheap kill because of that random mechanic of the game, when you get kill by them its so unfair.\nValve remove random crits from Casual.\n\n3. Menu music, each time you enter the game, music sounds on the menu, in my case i dont want to hear the music everytime i enter the game, Valve put a buttom to deactivate the music so it doesnt sound each time we enter the game.\n\n4. Valve never released neither the Uranium nor the Mirror Botkiller weapons\n\nOperation Oil Spill, Steel Trap, Mecha Engine & Gear Grinder Rewards gives rewards that nobody wants/uses now, it should be added at least 1~2 hats for a tour completed on those Operations,\nplayers only get Rust,Blood,Silver mk1, Gold mk1, Silver mk2, Gold mk2, Carbonado & Diamond botkiller weapons that now, are worth almost nothing and almost noone use them\n\n4. Friendlies\n\n5. Afks\n\nMap Lazarus's visual artifacts in form of square shapes forming a sphere\n\nDemoman's Grenade Launcher does have 6 barrels when the weapon only shoots 4 pills.\nValve change the model and animation for its four pills.\n\nDemoman's LochandLoad grenade launcher, in the past it only had 2 pills and its model was right, but now the weapon has 3 pills to shoot and its model still has the old two barrel gun. Valve please change the model\n\nSome icons like the demoman's should be a stickybomb not a generic bomb, in my opinion\n\nToxic PvP\n\nToxic Mann Up Mode Mann vs Machine \n\nToxic Mann Up Mode Mann vs Machine \"TACOBOT\" thing\n\nRage/Triggerting Bait \"ez, your mom ez\" posters, they arent punished\n\nToxic Taunts, Luaghter & Dancing, dont laught at me\n\nSniper Rifle OP and Snipers Annoying, you must prioritise it as target and kill it fast or neither you or your team cant do a thing, very hard to see on long distances, disrupt the game abruptly\n\nSpy annoying, disrupts the game and the phasing of it\n\nSoldier's \"thanks soldier\" annoying\n\nDemoknight annoying\n\nW+M1 Pyro that comes out of nowhere Annoying\n\nScorch Shot Annoying\n\nFriendlies and \"Friendlies\", one of the worst things\n\nWutville map\n\nHelltrain map, Graveyard map, and other Halloween maps that i dont remember their names right now\n\nUgly Weapon skins, why did you let this happend\n\nUgly Halloween and \"X\"mass cosmetics, why did you let this happend\n---\nProblems with weapons:\n\nThey never released the old weapons like the grenades, Nail Gun, Tranquilizer Gun, etc.\n\nThey never released alot of weapons that were ready to drop like the Afterburner, Assault Cannon, Inside Jab, the Specialist, the Spitfire, etc.\n\nThe Scattergun doesnt have double shot\n\nThe Force-A-Nature doesnt have double shot\n\nThey removed Soda Popper's Minicrits, the weapon is trash now\n\nThey nerfed the Baby Face's Blaster's because it was \"\"\"\"\"\"bugged\"\"\"\"\"\", the weapon is trash now\n\nThey nerfed the Crit-a-Cola, the weapon is trash now\n\nThey removed the Sandman's Stun Effect, the weapon is trash now\n\nThe Sun-on-a-Stick, this weapon is bad since its release\n\nThe Liberty Launcher has no use now\n\nThe Cow Mangler 5000 has no use now\n\nYears have passed and the Gunboats wasn't never given to Demoman, why are you this evil\n\n*sigh* The Righteous Bison, this weapon was cool but OF COURSE they had to remove some of its effect THAT WAS SUPPOSED TO DO AND WAS NOT A BUG, and then, they nerfed it even more\n\nThe Equalizer has no use now\n\nThe Manmelter, another cool retrofuturistic weapon that its visuals were bugged since its released and now i dont even know its stats state.\n\nThe Scorch Shot, Annoying weapon that doesnt even do considerable damage its just there to annoy players, those who use this deserve chronic severe pain\n\nThey nerfed the Axtinguisher, the weapon is trash now\n\nThe Sharpened Volcano Fragment, this weapon is bad since its release\n\nThe Hot Hand, this weapon is bad since its release\n\nThe Loch-n-Load doesnt have its third barrel for its third pill, bad\n\nThe Ullapool Caber, another nerfed weapon, it was very fun to use before, the weapon is trash now\n\nThe Eviction Notice has no use now\n\nThe Pomson 6000, another nerfed weapon, has no use now\n\nThe Vita-Saw, ...?\n\nThe Sniper Rile, OP Weapon, Extremely good players with this weapons locksdown the opposing team, hard to deal with\n\nThe Ambassador, unfairly nerfed weapon, this was one of the picks to deal with a Sniper.\n\nThe Enforcer, nerfed weapon\n\nThe Red-Tape Recorder, this weapon is bad since its release\n\n---\n\nGood things about this game?\n\n1. They added Zombie mode, semi-\"officially\"?, with community developers(?), that in the year it got released it did with hard crashes to desktop crashes but they got fixed now(?), BUT its only available for a limited time on October, and i like it, it is good for ME.\n\n---\n\nTeam Fortress 2 turned from an good Action Class based FPS WWII themed game that could sometimes be genuinely funny thanks to its physics engine, to a \"friendly\" shooter with ridiculous and ugly \"festive\" cosmetics and gun paints.\n\nInb4 \"STFU Kyle, cry louder-harder, cope, tldr, mucho texto\"",
            "weighted_vote_score": "0.466760963201522827"
        },
        {
            "review": "I had been waiting years to play this game because I was seeing how fun it looked. sadly, time after time I kept just getting games full of these AI snipers that kill you instantly. I would say this game is dead and I hope we get TF3 soon.",
            "weighted_vote_score": "0.51199108362197876"
        }
    ],
    "881100": [
        {
            "review": "This game is one of the best single player games of all time. Took me 136 hours to finally beat Kolmi, and now I am off to explore and beat the side quests. Noita is difficult to start without any knowledge, but the pay off when you figure something out is awesome, and the Noits community is thriving and generous with help and information. give this game a chance and it'll surprise you.",
            "weighted_vote_score": "0.705687284469604492"
        },
        {
            "review": "I just got my first win after 650 hours.\n\n10/10.\n\nActual review:\n\nNoita is incredibly fun. Each pixel (material) is simulated, and spell crafting is infinitely expansive. Not to mention the side-quests/secrets are more in-depth than any 3D game I've played, or any game for the matter. The modding community does a great job too. Even implementing co-op/multiplayer for Noita, along with graphical/QOL mods. I highly recommend this game even if you are on the fence of \"considering buying\". You will be challenged in the best possible ways, and it will feel rewarding when you do progress. Your wand building will only be limited by your imagination, and ultimately your demise. You will die, multiple times too. Probably a similar amount of deaths to souls-likes. I don't play souls-likes, however, I can imagine the difficultly level is similar. Don't let this throw you off though. Anyone can get into this game if you give it a chance. Love the game, incredible community, would attempt win again. \n\nStill 10/10.",
            "weighted_vote_score": "0.563758373260498047"
        },
        {
            "review": "If you love making mistakes over and over again with little bits of progress here and there this is the game for you! (Joke). This is actually a very fun game if you give it time. You will die A LOT before you make any major progress, but if  you stick through with it you will discover a level of fun I haven't experienced in a lot of games.",
            "weighted_vote_score": "0.546827793121337891"
        },
        {
            "review": "The game is too arcane so you have to spend too much time either trying everything or looking stuff up.  There are too many \"gotchas\" that prevent you from doing something you would expect to be able to do, or kill you for stupid reasons, and in a game with permanent death, it's not fun.  The game suffers from lag and crash issues, especially when wands become sufficiently complex, which is the most interesting/fun part of the game.  So if you want to really go crazy/fun with your wand build, expect the game to crawl or crash.  That's probably the biggest fun killer for me.  And the size of the world is incredibly large, but you are not provided any map, and many of the \"fun\" things to do are not linear, so you actually have to navigate the world and revisit places.  Again, not fun.\r\n\r\nThe open-endedness is a cool concept, however.  It just feels like an unfinished project.",
            "weighted_vote_score": "0.546812772750854492"
        },
        {
            "review": "This game requires learning matching skills. Good matching can be fun from beginning to end, but I can't learn matching moves.(crying......)",
            "weighted_vote_score": "0.519999980926513672"
        },
        {
            "review": "Incredibly dense, blisteringly challenging, brilliant mechanics. a game for the ages. play this.",
            "weighted_vote_score": "0.500947892665863037"
        }
    ],
    "2669320": [
        {
            "review": "As an avid fan of the franchise, it pains me to write this review for FC 25, which has delivered an immensely disappointing and frustrating experience. The most glaring issue is the abysmal gameplay balance, which feels more like a step backward than an improvement. Matches are too often decided by glaring AI inconsistencies, making even basic mechanics feel random and unreliable. It’s genuinely astonishing how unrefined the game feels after years of supposed advancements.\n\nMoreover, it's hard to ignore the evident lack of regard from EA for the game's current state. Community feedback seems disregarded entirely, with players voicing frustrations about bugs, balancing issues, and broken mechanics that have yet to be addressed. While cosmetic updates and monetization strategies are regularly prioritized, essential gameplay fixes are blatantly neglected, leaving the core experience in a poor state.\n\nIn its current form, FC 25 feels less like a polished soccer simulation and more like a cash grab, relying on fans’ loyalty without showing any commitment to improving the player experience. For a company as established as EA, it’s disappointing to see the community treated with such disregard, and the product itself left in such a poor state.",
            "weighted_vote_score": "0.918412208557128906"
        },
        {
            "review": "TL;DR - This game is a psychologically manipulative Skinner box. It is designed to be addictive, and to get as much money out of you as possible. Scripting, implemented to encourage FUT players to spend more money, is in every mode and makes every game an unsatisfying and empty experience. Considering a core demographic for this game is children, the income-focused manipulation displayed here is repugnant. \n\nDDA (dynamic difficulty adjustment) or scipting is just ridiculous now. In games against EA's garbage AI, if the game wants your opponent to score, they'll respond to your controller inputs instantly, not the actions of the player you're controlling. Easy tackles with world class defenders will either miss, bounce the ball to another opponent, just outright phase through the ball or even the damn player! Your keeper will do a Matrix-esque dodge of a shot coming directly at them or will spill an easy catch directly into their striker. The most outrageous though, is player switching on loose balls and when contesting headers. The game will sometimes prevent you from switching to a player (even manually with the right stick) if they're close enough to win a loose ball or are in the best position to win a header. They will instead just stand there, staring blankly into the distance, until the opponent wins back possession. It's the most obvious example of the game cheating to achieve the outcome it wants. This stuff is so obvious that I've been able to predict when a goal is coming, just by how many advantages the AI gets. \n\nOther examples:\n- 30 year old fullback with 60 pace will gain an otherworldly burst of speed to get ahead of my winger with 90 pace\n- Players will frequently and deliberately place themselves in a position to lose headers, even if you're instructing them to do the opposite\n- Opposition defenders will basically teleport to tackle you the second you press shoot in the box\n- Your passes will frequently go to a player in the complete opposite direction to the one you've commanded\n- Uncontrolled defenders will randomly clatter someone in the box, giving away a penalty\n- Some of the AI's most outrageous Sunday league fouls just won't be given \n- If the game doesn't want you to score anymore (or has the scoreline it wants to achieve), the opposition will just pass the ball around the back or run all the way back to the keeper upon any pressure. This would be fine if they weren't 2-1 down at 70', where any team would be pushing hard for an equaliser. Again, just breaks the immersion.\n- If the game wants you to score, all of these advantages are removed and opposing players lose 50 IQ points. It's ridiculously transparent. \n\nThese problems extend to all other game modes, especially Ultimate Team. \n\nAt the end of the day, all this does is damage the experience. Wins don't feel earned, since it's obvious that the game is allowing you to win. When you lose it's often because of the above advantages, not from been legitimately outplayed. For a game that aims to recreate football, it fails spectacularly in presenting the core part of that experience; the in-match gameplay. Neglecting this, by adding a scripting or variable difficulty system to psychologically manipulate FUT players to spend more money, not only irrevocably destroys the experience in all modes, but is also outrageously anti-consumer. I knew on reputation that EA Sports games were microtransaction ridden hellholes but this is predatory to a degree I've never seen before. Considering a core demographic for this game is children, manipulation like this is repugnant. Honestly, I feel dirty having spent money on this. \n\nDo not buy this or any other EA Sports Skinner box, it's a prime example of everything wrong with this heinous company.",
            "weighted_vote_score": "0.899025142192840576"
        },
        {
            "review": "I only got this game because of the career mode (manager career to be specific), so I'm only reviewing what that's like.\nThis year I personally think that the manager career mode is one of the best experiences we've had with the FIFA/FC games for quite a while now. I really like how tactics seem to matter more now than what they might have done in previous titles.\nThere are quite a few new features that I appreciate, such as the improved youth academy that allows you to play youth tournaments with them, although I wish it had a bit more \"depth\" to it. The social media feature is nice, but really it's just sort of a remake of the news feed you'd get in the previous games. The gameplay seems more akin to the sort of football you'd see being played in real life which I find quite nice.\nI really wish EA would add the ability to view results from past seasons (all of the leagues, top goalscorers etc.). Also the constant copy paste cutscenes get old really quick, there definitely needs to be more variety with them. I would also like for them to bring more customization abilities for your custom stadiums.\nI think there also needs to be a purpose for earning money as a manager, because you do get a salary, but there is absolutely nothing you can do with it.\nRegardless though, I can recommend this game for those who like football and feel like managing their own club is something they want to do.",
            "weighted_vote_score": "0.842542886734008789"
        },
        {
            "review": "If you're an Offline player like me who enjoys to play some Career modes then go for it, other than that Online modes are horrible as of today, this has the same release impact as FIFA 23, same problems. Career modes are fun and updated compared to last years game. It's only worth if you don't play Online much and when the price drop.",
            "weighted_vote_score": "0.795104861259460449"
        },
        {
            "review": "Bugs bugs bugs... so many I can only assume they are too lazy or neglectful to fix it. They only care about you spending your money on microtransactions",
            "weighted_vote_score": "0.740325331687927246"
        },
        {
            "review": "This game is fine but if you want to live past 30 you shouldnt play UT just play kick off with friends, Pro clubs or career mode. Thats fun scripting in UT is not.",
            "weighted_vote_score": "0.716122567653656006"
        },
        {
            "review": "Honestly, this is the worst game that I have ever played. Every match is literally the same. In first 20 minutes you know if you are going to win or lose the game. If the ball bounces at least 3 times around the box, you are going to concede the goal. Almost every match you are going to concede a goal in a stoppage time. There is no way to remove roles markers at the beginning of the game, so frustrating. Game is so scripted that is unplayable. Worst 60 euros spent in my life.",
            "weighted_vote_score": "0.673140287399291992"
        },
        {
            "review": "I'd recommend since I mostly only play the career mode and local co-op. The career mode looks fresh, more details. New ways to start career mode and I absolutely loved it. You can also play woman career. More customisation in the settings. The cranium update is pretty solid. There's also bonus points if you're online/connected to server when playing career mode, which I don't think that's a big deal.\n\nRush mode is ok. The commentary is bit annoying though. Not much to say about this.\nAs for the UT, it's rubbish.",
            "weighted_vote_score": "0.646752834320068359"
        },
        {
            "review": "EA , one of the worst game company . harvesting soccer fans yearly with same game and little updates . full of mistake daily content , take no responsible action afterward . if i have to rate this game , 0 is the point . 2k sports come to soccer games is all i wish ... \n\ndo not buy any ea games if you dont want to waste your time .",
            "weighted_vote_score": "0.614085733890533447"
        },
        {
            "review": "I don't know how to say it but this is the most pathetic and completely disgusting game I have ever played. My initial thoughts on this before was maybe it's gonna be better than EA FC 24 but by the divine intervention of the gods themselves, EA has made it significantly worse in nearly every aspect. Why do I still have bugs from EA FC 24?? Just why?? Have you actually played your game??? Everything top to bottom is horrible apart from clubs(but that's only fun if you have people to play with, good luck if you're doing drop ins)\n\nThe community itself is a trainwreck too, 2 parts of it specifically: 1. The people who keep buying these FC points and allow this game and gameplay to be horrible. 2. Who keeps buying FC Points!???!?\n\nHonestly don't know how these guys sit there and say they are proud of this game... Absolute delusion in it's finest.\n\nIn summary dear reader: Search up the meme \"Our Expectations Were Low But Holy F***\" and this game embodies that meme to a tee. Wouldn't let my worst enemy play this game. I'll only stick to clubs but this game is just disappointing.",
            "weighted_vote_score": "0.565217375755310059"
        },
        {
            "review": "I recommend this game only if you play full manual online seasons or offline modes. Don't play FUT and enjoy the game :)",
            "weighted_vote_score": "0.56284797191619873"
        },
        {
            "review": "The worst game of the series. EA only cares about profit and nothing more. Quick bug fix only if it relates to the FUT monetization.",
            "weighted_vote_score": "0.560058653354644775"
        },
        {
            "review": "Pure FC24 with makeup of some Tactics option.\nIt is full of cheaters in Ultimate teams Champions, EAAntiCheat which is EasyAntiCheat btw just renamed is not doing anything again!",
            "weighted_vote_score": "0.55915600061416626"
        },
        {
            "review": "Every year EA just continues to disappoint. I couldn't even get the game to launch! Despite almost 2 hours trying various solutions but nothing worked! How can people pay money just to be disappointed so badly? \n",
            "weighted_vote_score": "0.5579567551612854"
        },
        {
            "review": "Worst FIFA/FC ever made since 2018.\nIt legit feels like you are playing an AI and not a real person with all the new defensive mechanics.\nDo not buy this game, its a legit waste of money",
            "weighted_vote_score": "0.557888388633728027"
        },
        {
            "review": "Garbage game, Garbage mechanics, Retarded AIs, and just a money hungry remake of earlier games. Dont buy if you want to preserve your wealth and mental health.",
            "weighted_vote_score": "0.556291401386260986"
        },
        {
            "review": "For career mode/FC IQ tactics: DON'T buy this game as FC IQ sucks and worse than the previous custom tactics\nPro: good marketing of the new FC IQ tactics\nFC IQ tactics might be good for those who are new to football (games) (because FC IQ over-simplifies tactics)\nCons: actually MUCH LESS tactics custom options now with the strict IQ tactics\nFirst, FC IQ tactics does not mean you can set one formation during possession and another formation during defence, you can only have one formation for both possession and defence\nYou can't adjust the position of any player (you can only use the preset formations which are limited in variety)\nIf you want to play 433 with 2 CAM and 1 CDM? Sorry you can't as there are no 433 formations with this midfield combination\nIf you want to make an asymmetric formation (like having a LW with a RM)? Sorry you can't as the preset formations provided are all symmetric and standard formations\nIf you want to make adjustments during a match? Sorry you can't adjust the position of players (player positions cannot be adjusted (like making a CM to CAM when you are losing), only the very limited attacking instructions and overall formation can be changed\nIf your defence is under great pressure? Sorry your LM/RM/CM/CAM won't help the defence and will stand still and watch the ball on the midfield as the IQ thinks the jobs of the midfield players are only for the midfield (no options on defending behaviours)\nIf you are having a clear and potential chance of one-on-one opportunity? Sorry even if your CAM/CM is next to you, he may stand still as he belongs to the midfield)\nInconsistent gameplay and possible scripting (I play 10 min half time, and I have experienced this frequently - during a match if I score, then the speed of the player movement and the ball, as well as the action of every player will be boosted suddenly, and my sliders will no longer apply, and the AI will pass the ball very quickly and score easily as your defenders will just stand still without tracing the attackers and your GK will just dive on the ground without saving it even it should be a easy save)\nUnfair game with the AI\nWhen the AI defends. for many teams, their midfielders and defenders will have a very compact defence shape (they may even get speed boost when they tackle you) But for your own team, only defenders are defending, even sometimes they just stand still and watch the ball (For attacking it is in similar scenario) (Kind of intentional design by the game)\nIt is also easy to end up with abusing one-two through pass/dribbling as your players won't move(strikers frequently end up in stupid positions of the box like moving slowly far behind you/do't appear in empty space)\nI have also experienced a lot of bugs/crashes/screen freezes, especially in half time/between the end of a match and the start of the press conference that I cannot do anything but close the game directly and lose all the progress (I have no problems playing other AAA games in high settings)\nDisclaimer: I have tried and applied no sliders/preset in-game sliders provided and many popular sliders provided by online communities, and I have only played career mode games in legendary difficulty (I heard that world class might provide a more realistic experience but it is too easy for me to win), so what you might experience can be different\nFC IQ tactics is a good try/starting point in my opinion but too far from finished product which mimics realistic tactics in real life football",
            "weighted_vote_score": "0.554169893264770508"
        },
        {
            "review": "I can’t even comprehend how bad a video game can be, so here are my thoughts (mostly about Ultimate Team) as a pros/cons list.\n\n\nCONS:\n-Nontent every day; I can’t remember the last time they added a quality SBC that wasn’t either overpriced or just down right bad.\n- \"Microtransactions\" - packs cost €15-25 each; with new packs added daily, I assume that's what they call “content.”\n- There’s always at least one AFK player in rush games, since it’s the quickest way to complete evolutions. You can’t do anything about it, so you just carry on, struggling against tryhards on the opposing team. I wonder if they’ll ever add an option to kick AFK players.\n- There was no option to mute the commentator in Rush mode until they finally added it in a recent patch.\n- CPU defense is too strong. You’ll end up passing the ball around for 10-15 minutes, hoping your opponent will get impatient and rush their defender so you can finally score. The same issue exists in Squad Battles—sometimes, you’ll easily win on Legendary difficulty, while other times you’ll struggle to score and lose.\n- \"Nonexistent\" DDA - Even if your opponent is down 0-5 at halftime, they still have a high chance of making a comeback. EA, of course, claims there’s no such thing as Dynamic Difficulty Adjustment (DDA).\n- Player intelligence is poor; 80% of passes go off-target, so you end up losing possession. The defensive and attacking AI is lacking as well.\n- The game demands a huge time commitment. For better rewards, you’ll need to play 44 games a week (12 in Division Rivals, 15 in FUT Champions, 12 in Squad Battles, and 5 qualifiers), each lasting around 10 minutes. That’s 7 hours a week, which isn’t terrible, but realistically you’d need to play 20-25 games to achieve 12 wins in Division Rivals. While the rewards are better, they’re still not worth the time, which seems intended to push players toward store packs.\n- Many players do nothing but spam skill moves such as fake shots and roulettes, repeatedly losing possession. It’s repetitive and frustrating.\n- Running to the edge of the field, cutting back, and scoring is easy because the goalkeeper’s AI doesn’t react well.\n- The game crashes often after redeeming an SBC.\n- After every game, there’s a popup showing objective completion—even when nothing was actually completed.\n- Sometimes, the playstyle+ icon turns into large white triangles covering the screen, which requires you to restart the game for them to disappear.\n- Inviting friends to a lobby is unreliable, as the overlay button frequently disappears, forcing you to restart the game.\n- Draft  hasn’t been updated in eight years, and they haven’t even adjusted offline match length to match that with Squad Battles.\n- Lack of highly advertised cosmetic evos.\n\nPROS:\n- You can create good-looking players in Clubs mode.\n- Manager mode is relatively well-rounded and enjoyable.\n- Roles+ and Roles++ \n- Most Ultimate Team modes have updated rewards\n\nSUMMARY:\nWhile the gameplay feels smoother than in FC24, the experience remains disappointing, especially with the push for microtransactions. Overall, I don’t recommend buying the game or spending money on packs.",
            "weighted_vote_score": "0.602888107299804688"
        },
        {
            "review": "Get it On Day 1 \nHalf Price A Month Later\nsays a lot about the game -\nShit Servers , Shit Passing , Shit First Touch - \nNever Had to Sweat To score a goal .\nClubs became even worse .\n\nThe more i play , the more it infuriates me to why i play . \nIts Funny That Even after having a Physical of 90 my defender loses duels to a physical of 70 .\nEverything is just laughable at this point.\n\nThe more you grind clubs you will also realise half of the stats dont even mean anything , \nIts absurd , \n99 Finishing and the keeper yet somehow becomes a good to jump on a power shot from 30mtrs when its kunckling in at 130kmph lmao. \n\nA joke . yet we play.",
            "weighted_vote_score": "0.6024056077003479"
        },
        {
            "review": "Hello everyone, I hope I can help you in your purchase by sharing my experiences with this game. Let me put your mind at ease from the beginning. FC 25 is like a DLC for FC 24. The gameplay is almost a copy of the gameplay of FC 24, but nothing has changed.  What has been added to the game is the new tactics for the teams. Let's skip the gameplay. FC 25 is not a fair game in the ultimate team section, and you do not play in the same situation as your opponents, and your team and conditions may be much worse or better.  It is from your opponent and there is no guarantee that you can have a strong team without spending money. In terms of optimizing the game, it is in a good condition so that you can get 120 frames with the right graphics settings, but I am from some of my friends who have graphics cards like  They have 3060. I heard that the game has optimization problems, but I am not sure about this. In short, if I want to say, this game is not worth 70 dollars, and it is much better to buy this title at a discount.  And follow the news of the day, it can involve you for tens of hours or hundreds of hours, but before that, you should realize that you do not have the same conditions as your opponents and many other things that I mentioned in the above text in general.  If you are not a fan of ultimate team, I don't recommend FC25. If you wait for this title to be released on ea play, it is worth much more than spending 70 dollars.  I hope I was able to help you make a better purchase.",
            "weighted_vote_score": "0.551442921161651611"
        },
        {
            "review": "I've never seen defenders and goalkeepers more useless than this. There are cheaters in champions too.. just dont buy this game and save ur money ffs",
            "weighted_vote_score": "0.54791259765625"
        },
        {
            "review": "My FC25 is experiencing freeze and crashing issues. When starting a match, the screen goes black but the text 'Full Intro Match' still appears. Even if the match manages to start, it freezes after it's finished and during the loading screen. Does anyone know why this is happening? On the first day I played FC25, everything was fine and ran smoothly, but on the second day, problems like this started appearing. This happens in Manager Career mode, Player Career, Kick Off, and even Ultimate Team. I've tried updating and several other methods, but nothing has worked. Please give me a solution. Thank you",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "Microtransactions galore.  Not sure why I'm so addicted to this game.  Half the time it fails to launch - running a 4080 Super... not a hardware issue.  The Ult team grind is harder then its ever been, driving microtransactions down your throat to keep up with the meta.  This game sucks",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "This is the worst football game ever made. The gameplay is terrible, with severe delay and heavy controls in most online games, passes go in random directions, tackles from behind don't result in fouls, the AI literally cheats when playing against the CPU. Additionally, hackers ruin the online experience.\r\n\r\nWhoever is responsible for designing this game should resign and never apply for a job in games design in the future. They have created the least competently designed game in AAA history. Shame on you all.",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "I only play career mode, and nothing makes sense there. They have actual ADS in the social media fake app, with fake comments not even remotely close to on topic. The crashes are insane! Every time i play a champions league match the game freezes after the final wistle.\r\n\r\nFIX YOUR DAMN GAME!\r\n",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "Bought game, spent almost 1 hour trying to fix multiple issues, from not launching at all to \"failed to join session\" to controller not working to controller only partially working. I never even got to play the game\n\nGot fed up and requested refund, not worth it even at a 50% discount",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "What we want each year\n\n- Fun / entertaining gameplay\n- Interesting cards that are affordable / easy to grind\n\nWhat they gave us:\n\n- Terrible gameplay across the entire pitch\n- The worst input delay ever conceived\n- Servers running on a potato\n- Thousands of packs in store to supply that awful gambling addiction you have\n- Attacking and defending AI is the worst its ever been. I don't think calling it \"FC IQ\" actually means anything\n- You MUST play meta. If you don't you ain't winning\n- Meta players are more unobtainable than ever before unless you spend ££££. That special 84 rated player you just packed from the new promo is useless and sits at 10k coins on release\n- This game has a great mechanic of making the better player lose. Don't know how they managed this but they did. Just play a few games and watch the rage ensue\n\nNot sure why i keep buying this game.\n\nCan't wait to buy it next year...\n\n",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "Я не понимаю, как можно КАЖДЫЙ ГОД делать ОДНУ И ТУ ЖЕ ИГРУ, и КАЖДЫЙ ГОД совершать какие-то непонятные ошибки и лишние \"движения\", которые мешают игровому процессу. Прошлая часть была страшно забагованная, катсцены пролагивали, играть было не очень комфортно. Эта часть - прекрасна в техническом плане (причем сразу на старте продаж!!!!!!), но абсолютно (лично для меня) неудобный интерфейс, новые ощущения от игры и общее впечатление. Каждый год покупаю и каждый год думаю - как с таким огромным опытом в производстве одной серии игр можно постоянно косячить.",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "The worst game of ALL TIMES... Nothings works.. full of bugs, passing is worst than ever, server connections worst than ever, gameplay worst than ever. Not worth a penny. !!!!! DON'T BUY IT!! YOU WILL REGRET IT",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "EA are a complete and utter disgrace. they have allowed pro clubs to disentegrate to the point of unplayability. year upon year there are new bugs and glitches to add to the usual nonsense we have to suffer. you would think the game was made in  a single night by a student, not a billion dollar company. EEZ A DIZGRACE",
            "weighted_vote_score": "0.545454561710357666"
        },
        {
            "review": "This is THE WORST game made by EA I have ever played. the amount of bugs is insane in career mode and UT.",
            "weighted_vote_score": "0.54356849193572998"
        },
        {
            "review": "Easily the worst FIFA/EA FC game yet. Gameplay is garbage and not enjoyable, passing shooting, ai all terrible. hacking on PC is ridiculous. At this rate next year it will be just a card collecting game.",
            "weighted_vote_score": "0.541984736919403076"
        },
        {
            "review": "Game is complete Garbage. Stutters for no reason. Poorly optimised. Randomly ignores controller midway through playing, for M&K inputs...\nNothing good to say about this, yet another rip off by EA...",
            "weighted_vote_score": "0.53947371244430542"
        },
        {
            "review": "This game is full of hacking and scripts. It is a failed game. Part of the sale failed. It is not worth a single dollar. Very bad.",
            "weighted_vote_score": "0.536423861980438232"
        },
        {
            "review": "EA destroyed the gameplay for this one. \r\n\r\nThe players are extremely slow, even the ones with supposedly high Pace. It feels as such as no one player can outrun another one. \r\n\r\nThe passing is very imprecise, with players barely being able to receive the passes and more often than not just throwing the ball away, passing to the adversaries instead of a team mate. \r\n\r\nThe goal area always feels like its crowded and the AI barely needs to do anything to get the ball from you or just make your player trip as if he was made of paper, while the other way around it takes 2-3 players tackling and heckling to get an opponent down\r\n\r\nOverall, the game feels like a huge downgrade from the last couple years, at least when it comes to what actually matters which is gameplay",
            "weighted_vote_score": "0.535579562187194824"
        },
        {
            "review": "This game is in contention with one of the worst football games ever. The game feels way too easy. I played career in legendary difficulty and won 1-0 and 6-0. Most of the goals i scored were due to AI mistakes (like bad pass in their own half). EAFC24 is far better in terms of gameplay. Career mode UI is one of the worst UI ever. Navigation between various options feels clunky. Other than that the game feels fine but the core aspect is disappointing. I tried to refund but I will fail because playtime > 2 hours. I played only 2 matches, all my time was spent on setting up career mode and navigating between the options. My advice EAFC25 is not worth even if you get 80% discount.",
            "weighted_vote_score": "0.533898293972015381"
        },
        {
            "review": "Dementia simulator. Ur players forget u clicked button and remember after 3 seconds. Dribbling while u have insane amounts of ping is great. Players move like they have 1 tons of rocks strapped onto them.",
            "weighted_vote_score": "0.583333313465118408"
        },
        {
            "review": "game keeps glitching and doesnt let me play. Even when i do the gameplay is horrible and the scripting is insane. DO NOT BUY THIS IS THE WORST FIFA EVER",
            "weighted_vote_score": "0.533239066600799561"
        },
        {
            "review": "If you play career mode, dont buy it. \nAI is so bad.... they cant score goals. I started a career mode with Brescia and I won the league with no defeat and conceded something like 10 goals. AND I PLAY ON ULTIMATE DIFFICULTY. They just pass the ball around the back and they always have 80% possesion. You just run around for 10 minutes until eventually you steal the ball and score.\nAnd dont get me started on the players faces from youth academy. Like bro...... what??? \n",
            "weighted_vote_score": "0.53271031379699707"
        },
        {
            "review": "It's the first time I've given a bad review for a game I like to play. So, why am I doing this? Because even though I enjoy the game, I can't overlook some greedy choices made by the developers. For example:\n\nIn My Club/Rush Mode: There is no option to report players using bots or AFKing, which makes many games uninteresting and frustrating.\n\nSeasons Mode: There's a persistent bug that prevents you from modifying your tactics/roles. This issue has been present since release and has been reported by hundreds of players on the official forum, yet nothing has been done to fix it. Unbelievable.\n\nFUT Mode: The transfer market is plagued by bots, as it is every year. I understand that it's hard to prevent this, but it's still a significant problem.\n\nAdditionally, there are missing licenses for certain teams, like Belgium, which I was really looking forward to playing. This is an issue for other people as well, as many other teams are absent.\n\nFinally, there's no option for couch play in Rush Mode against other players online, which is a big letdown.\n\nMost things are copy pasted from fc24 but you pay a full game and restart from 0.\nI like the gameplay like last version of the game and I appreciate it's fast to find other players online.",
            "weighted_vote_score": "0.53125"
        }
    ],
    "2582560": [
        {
            "review": "It is a shame that EA has the exclusive License for NFL content.  This game is awful.  Madden has been awful for years and nothing changes.  This is a $70 game and it hardly works. Out of nowhere, none of my controllers work for this game now.  PS5 controller worked when I first bought it with no issues. It stopped working randomly and I noticed the game only \"Supports\" PS4 controllers and Xbox controllers.  Tried the PS4 controller, and shocker it didn't work either.  Now I have a $70 game that is literally unplayable.  A 2K football game would be pretty sweet right now.",
            "weighted_vote_score": "0.763209640979766846"
        },
        {
            "review": "This has always been a hot take for me to even consider buying. Since 2016 I haven't dared waste my money until now since it's had time to 'age' properly.\n\nEDIT: I would like to amend my original statement after more attempts to play it to also add that the audio does not work unless you shut off all system outputs and enable only the desired one. They literally designed it like that and it says this here on their website: https://answers.ea.com/t5/Technical-Issues/No-Audio-at-all/m-p/12873909. \n\nWhat game does that? Secondly, It has crashed more times in 80min than I've had all my games crash over the last three years. and if it doesn't crash the keyboard or controller layout will switch randomly when trying to run a play or call a timeout making it completely unplayable. This isn't a game, it's a scheme.\n\n2.25/10, for the artists, and occasional good frames. You're dreaming if you think this is a big title anymore (EDIT: Or a functional game) and should properly reflect a worth south of $10.",
            "weighted_vote_score": "0.697012424468994141"
        },
        {
            "review": "I play only franchise mode on madden. To be more specific, I only play PLAYER mode on madden. Every year they get rid of a feature then later on add it back the next couple of game releases as a \"new\" feature. They removed the one mode I play the most on and completely ruined the game for me. I'm sure the rest of the game might be fine, and there is a superstar mode that allows you to play a MyCareer. But I'm just not interested in that.",
            "weighted_vote_score": "0.686591923236846924"
        },
        {
            "review": "PC players cannot launch this game and EA is doing nothing to fix it. Do not buy this game. We have been over a week with no resolution. Many of us have even went as far as reimaging our PC's.",
            "weighted_vote_score": "0.600674092769622803"
        },
        {
            "review": "Long time Madden player. Enjoy the updates. Wish they would update contracts as they are signed as in real life. But love the game.",
            "weighted_vote_score": "0.557665467262268066"
        },
        {
            "review": "Game is unplayable. A true piece of garbage. I have a laptop that can run cod at 90 fps and has no issues playing any other game but won't run this even with minimum settings. I have 8gb of VRAM and 32GB of Ram and this is the ONLY game on my entire game list that has issues. The graphics aren't even that good. EA Sports and mainly the team working on Madden has got to be the worst game creators in the history of games. I wouldn't recommend this to my enemies. Not worth $5",
            "weighted_vote_score": "0.532163739204406738"
        },
        {
            "review": "horrible game constantly having frame issues and optimization issues dont buy it",
            "weighted_vote_score": "0.529729723930358887"
        },
        {
            "review": "I play heavy majority Franchise mode and this is the worst madden I've played and I've been playing since madden 16. Kicking mechanic is new and worse. The play selection is new and worse making it harder to choose the play you want. The draft board is new and worse making it harder to determine who to draft. the lineup is more difficult to set. the players look actually LESS realistic than the last game I played which was '23.",
            "weighted_vote_score": "0.52844315767288208"
        },
        {
            "review": "Game crashes on start, wont work on PC. I played it for a day with no issues (about 3 hrs), next day I attempted to play again, perma crashes on start. Dont buy this even on sale.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "I was having a lot of fun on this game until i could no longer play it. When I launch brings me to the splash screen and then crashes this issue has been happening to a lot of people and has not been addressed. DO NOT BUY.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Honestly was a good game until i couldnt even launch it anymore! lol i bought the 15$ season pass and return your game stops working and ea/steam does nothing and says nothing about it (i've tried everything and still no answers to this issue)",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Game is terrible stopped launching, You need to do 100 things to try and make it work. DO NOT BUY ON PC!",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "bought the game while it was half off because \"football\" but the game crashed in each of the first two games i played so i refunded it. what little of the game i did play mostly felt like every other madden game over the last 10 years with some new styled ui elements to give it the ol landlord special with a fresh coat of paint on top of something that should be condemned.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Superstar mode still doesn't work it just loads forever. Same old broken madden I was stupid for thinking it would be different this year for some reason.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Defensive A.I. is terrible per usual hit tech is glitchy just dont play the game save your bread.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "constant crashes. gameplay is worse. franchise no player option",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Same bad game, different year. EA continues to allow for long standing issues with the Madden franchise to make it into each game. The physics engine and animations are unrealistic, and EA seems more concerned with graphics and interactions between players after a play. Menus are less responsive and servers are exceptionally unreliable resulting in lag and crashes mid-game. This game is only worth picking up if it is on a significant sale. They have changed things to make it look like they attempted to increase quality, but all \"improvements\" are superficial at best. If EA ever loses the exclusive license to the NFL, Madden will almost surely die out if their effort doesn't improve.",
            "weighted_vote_score": "0.523263216018676758"
        },
        {
            "review": "It's exactly what you expect from a Madden game.  I won't say critics are \"wrong\", but what they're saying doesn't apply to me, a regular dude who just wants to have a football game.  Franchise works, exhibition works, and I assume multiplayer works (although I haven't tried it).",
            "weighted_vote_score": "0.52173912525177002"
        },
        {
            "review": "Multiple controllers show up while using my PS5 controller in franchise mode with only one connected. :) Great game",
            "weighted_vote_score": "0.518518567085266113"
        },
        {
            "review": "UI is jittery doesnt respond to button inputs, when trying to start a game it registers two controllers even when nothing else is plugged in. Garbage game that steam wouldn't let me refund.",
            "weighted_vote_score": "0.566929101943969727"
        },
        {
            "review": "0/10. Quite a sh*tshow. I liked CFB 25 so I thought I'd port my CFB Road to Glory player to Madden 25. Turns out it's a scam.\n\n1. You can't play as a player in Franchise mode anymore. What to play as a player? The only option is Superstar mode.\n2. Superstar is a grind like 2K basketball's player mode. If you don't buy booster, you can't even finish the first batch of quests.\n3. Again Superstar mode, you can't customize the player. The archetype dictates your player's potential. Utterly nonsense.\n4. Your CFB player has ABSOLUTELY NO EFFECT on the Superstar mode, despite it's marketed that the player \"will carry over, including the player history\". No, you start the mode as if the player is the generic default player except one mention of one award my player had won in CFB 25.\n5. You can't even customize game sliders and team rosters in Superstar mode because  they want you to GRIND.\n6. You start with 60ish overall rating for a QB, regardless of your record in CFB 25 and in the Combine, because they want you to GRIND.\n7. Magically the mode traded my team's starting QB away (Justin Herbert to Rams LMAO) just so that it can start me. Immersion breaking.\n8. It's insulting that they even got Tyreek Hill to record a video telling you to GRIND.\n9, Constant server disconnects that will FORCE you out of an ongoing SOLO match. Can you believe this sh*t?\n\nThe funniest part is the Superstar mode is online only. The server will shutdown in a few years, which means your grinding will be gone, your time and money wasted and you won't even have a player mode.\n\nI have played Madden 20, 22 and 23. 25 is absolutely a step backward except for revamped graphics, which looks kind of weird anyway.\n\nDon't buy. Don't encourage EA. Save 50+ GBs on your hard drive.\n\n P.S.: Again EA tried some DEI sh*t in this game. For CFB25, they put unrealistically high amount of non-white cheer-leading population, and the cheerleaders are simply ugly. I could live with that because it wasn't part of the gameplay.\n\nBut with Madden 25, they put a terrible girl announcer. It's part of the core gameplay. She is just terrible. NFL occasionally has female announcers and they are decent and relatively rare. Forcing a half-good announcer into the game just because she is female is just unbearable.",
            "weighted_vote_score": "0.512854814529418945"
        },
        {
            "review": "This game is ANOTHER piece of AAA GARBAGE. My game wont even let me open the steam overlay to PURCHASE POINTS FOR MUT. YOU DONT WANT MY MONEY? FINE. FUCK OFF TO OBLIVION YOU GARBAGE FUC KING COMPANY",
            "weighted_vote_score": "0.50166553258895874"
        },
        {
            "review": "This game is trash on PC!!!! The fact that it plays fine until purchased is insane. This game is broken on PC platform and absolute trash!",
            "weighted_vote_score": "0.5"
        }
    ],
    "2933620": [
        {
            "review": "First couple weeks was great! Bowser and Nikki Minaj werent Eiffel Towering me until I was barely conscious, the characters were normal, military fitted player characters, and everyone was shooting regular bullets out of their guns. \nLife was good.\n\nThen the season pass came\n\nAll of a sudden the minecraft enderdragon is shooting me with acid and this game turned back into every game before it, complete ass.\n\nAll I want in life is a cod like bo2, bo1, mw3, mw2, cod4, waw, with normal characters. None of this tracer bs where Willi Wonka is sliding up my ass filling me with chocolate.",
            "weighted_vote_score": "0.944610893726348877"
        },
        {
            "review": "1 hour before work\nWant to grind some camos\nOpens COD\n75GB update \nWait 25 min to download\nOpens COD again\nWait 2 minutes to download title update\nRestart COD to apply update\nOpens COD again\nWaits 5 minutes to install shaders\nSelect Black Ops 6\nVideo plays for new seasonal content\nSkip video\nPop-up ad for pay-to-win content in the in-game store\nPop-up ad for Battle Pass\nSecond-pop up ad for Battle Pass\nAutomatically opens to menu for Battle Pass\nSelect Multiplayer\nSelect Find Match\nWait 2 minutes for SBMM to put me a lobby above my skill level\nGame crashes due to Dev Error\nHave 20 minutes before I have to go to work\n\n😑😩",
            "weighted_vote_score": "0.939257502555847168"
        },
        {
            "review": "Bought the vault edition upgrade and never received the in game items, made a ticket with Activision support and they said there's nothing they can do about it. Waste of an extra $30.",
            "weighted_vote_score": "0.906968593597412109"
        },
        {
            "review": "game is fun, but the company is predatory and really doesnt care about its playerbase. theyre just trying to sell product to a gullible audience (me). the first thing you see when you open the central app (also predatory business tactic) is 3 buttons, the largest of which is just an add to buy the $30 cosmetic pack. \n\nplease dont buy this game",
            "weighted_vote_score": "0.845208168029785156"
        },
        {
            "review": "[b]The good:[/b] \nI originally thought that Omnimovement was going to be an absolute nightmare of a system to play against, with people abusing it to play the game like it's the Matrix... but it's actually a really nice intuitive system that could use some tweaks that I would like to see adopted as somewhat of an FPS standard with some tweaks (stamina, or take damage if you hit stairs, ETC).\n\n[b]The BAD: [/b]\n[list]\n    [*]Gunplay is the worst it has been in a COD I've ever played. Headshots don't matter because most guns take the same number of bullets to kill to head or body.\n    [*]Turns out some guns (like the AK) only do 15% more damage with headshots, what the actual hell?\n    [*]Hit Registration doesn't make sense. Get 10 hit markers with an XM4 at 20 meters and still die.\n    [*]No Ground War/Large Map game modes that let you run around and approach fights from a variety of angles.\n    [*]Nothing like staring at 1 minute of \"BEST PLAY\"/\"Watch 3 people emote at the screen\" at the end of a round instead of starting the next.\n[/list] \n\nI seriously regret buying this, wish I could refund, but the issues took more time to recognize.",
            "weighted_vote_score": "0.792547106742858887"
        },
        {
            "review": "my last proper COD was Black Ops 2. \n\nplaying this game makes me feel like a 12 year-old again but with a job and that’s a feeling that only certain games could make you feel.\n\nthank you treyarch. \n\none comment: maybe less dragons and wings in bundle purchases to keep the game realistic?",
            "weighted_vote_score": "0.771333932876586914"
        },
        {
            "review": "Firstly how can this game be 170 GB? i truly believe there's a secret folder full of Furry P. THERE IS NO WAY this game can take up that much space. And Whoever decided to add all games in the same launcher must either have the smallest brain or the biggest monster in their pants and decide to make us all suffer so he can watch down on all the people trying to download this game whilst tugging it dry. I just don't understand why i waited since 1981 to download this 180 GB game just to get an update after for 150 GB. I'm still waiting for the 70 DOLLAR game to download or should i say every other cod just because this guy with his pea brain decided to make all the games in the same launcher instead of making each one separate like every other game. i could've downloaded every 18+ Game and fully achieved each one with my monitor splattered in my \"milk\" before this game came close to a quarter downloaded. Please save your money.",
            "weighted_vote_score": "0.755032181739807129"
        },
        {
            "review": "Black Ops 6 Campaign: One of the best since MW2019. It's an interesting story that crosses between historical telling, horror and spec ops. Great to have a band of characters I can enjoy and a story that has logical telling and backup for it.\n\nBlacks Ops 6 Zombies: Actually the best since BO2. Love playing it and probably will play this the most out of anything. Love the grind; round based zombies is great with the optional Easter eggs that is enjoyable to do.\n\nBlacks Ops 6 Multiplayer: Dear fucking god no. I won't touch this anymore. I can't seem to find the logic behind making SBMM in regular multiplayer. I don't have the time to grind 9 hours a day like the sweats do on here. If I dare have one good match; the entire evening is ruined by being placed into match after match of no job lifeless sweats who don't do anything but nut as much as possible over their keyboard and mouse while listening to \"RING RING OF THE FIRE\" music morning and night.\n\nBO6 MP Cont.: Not to mention the 'Skill Based Damage'. Yes it is real. Yes it is game ruining. Yes it is stupid. I love going 24/6 in a match then mid-match it changes, taking 7-10 rounds to kill a person. Before finishing the game at 28/39. Because none of my bullets are dealing the same dmg that they did in the beginning. It makes MP entirely unplayable because you're not even allowed to be decent at the game. If you're shit at the game, boom you get to deal more dmg than those better than you. This is the most outrageously stupid thing they have ever implemented.\n\nVerdict: Yes. 2/3rds of the game is great, but MP with SBMM and SBD becomming the norm. I can't recommend this for the MP enjoyers. Though if you love zombies and campaign, this is up your alley.",
            "weighted_vote_score": "0.747076272964477539"
        },
        {
            "review": "7/10 \n\nCampaign - Overall I enjoyed the campaign, the story is solid up until the end which just gets silly.\n\nZombies - First good zombies in a long time. Looking forward to any DLC maps released.\n\nMultiplayer - Gameplay is fun, guns and movement feel very good although maps are a let down. Spawns could be better but recently improved. Voice chat is hit or miss but hopefully will be patched soon.\n\n",
            "weighted_vote_score": "0.744849145412445068"
        },
        {
            "review": "Got the game for the zombies. For whatever reason the game kicks you for being AFK more than a couple of minutes if you are playing online in zombies. Nothing more infuriating than getting to a high round in zombies and stepping a way for a couple minutes to find that you've been kicked and can re-join but everything you had is gone. Why?\n",
            "weighted_vote_score": "0.74362480640411377"
        },
        {
            "review": "Dont like the active and constant monitoring of language. I understand in lobby but why is a Mature game censoring private team chat. I fell into the trap of purchasing this game and should have known AAA games are gone now.",
            "weighted_vote_score": "0.741391956806182861"
        },
        {
            "review": "This game is the most fun I've had on a Call of Duty game since Black Ops 3. So before I critique anything, I'll comment on the good parts of the game:\n\nZombies - The most time I've spent on the game has been on zombies. It's a blast with Terminus having it's main quest and exploring the map and finding your areas to play at. Liberty Falls is the much MUCH easier map recommended for the people just getting into the Black Ops 6 Zombies feature or are returning after not playing any of the newer games. Very spacious, and great for doing a lot of Dark Ops Challenges. The Elite enemy on Liberty Falls is much easier to defeat than the Elite on the Terminus map, but are both difficult to some degree. \n\nGuns - The guns all feel amazing to use on their own accord, From base weapons to using elementals, and Pack-A-Punch; They all just feel really good and make the game feel good in every mode. \n\nCampaign - One of the best campaigns I've seen of most Call of Duty campaigns. Starting with picking up from Cold War, coming to a solid end. Loved the Easter Eggs and References.\n\nMultiplayer - The mode I've spent the least amount of time with the game on; This mode could be improved more, but from what  I've seen since the beta it's improved with more guns to use, and new maps being released the mode is slowly improving more and more; which is appreciated by the community/\n\n\nHere are some critiques/issues I do have with the game:\n\nZombies:\n\nThe Points System - This system was changed from the older games going from receiving points for every bullet hit on a zombie where you could be trading in weapons for more points, or trading in points for more hard hitting weapons to every weapon makes the same amount of points regardless of headshots or basic kills. Point balances with this on zombies would make it a much more fun experience.\n\nElites and Specials - The Elites (Abominations, Amalgams) & Specials (Manglers) aren't typically too difficult in the game, but it changes drastically when you hit a certain amount of rounds. Multiple Elites and Specials spawn in one round making the game much harder than the round you're on should be. The spawn rates of these enemies also aren't balanced to a team size difficulty; so if you're playing alone to a certain round you can encounter the same amount as you would with a full team.\n\n\nCampaign:\n\nOnline Only on a single-player mode - So as anyone reading this knows, campaign is typically single-player, which should be set as an offline feature. It's not. Playing in the middle of the game, or when you're about to hit the end of something difficult without a save point you can be taken out of the game by losing even a slight bit of your WiFi connection and restart from the last checkpoint. \n\n\nMultiplayer:\n\nNo Ranked Mode - Currently the game doesn't offer a ranked mode which makes sense as the game had just been released, but there's also the issue of skill-based matchmaking where if you play even decently for a single match or a few matches you'll be put up against players that have higher skill compared to you or to a player that's coming in as a new player. Putting a ranked mode would give players the option to play against others with their own skill, or a mix of everyone but would also decrease the amount of heavily skilled players compared to others just trying to enjoy the game.\n\nMap Spawns - This is something that's always been an issue in every Call of Duty game, but with how the maps are laid out the spawns are put in places where if someone spawns in they can get spawn killed over and over again, not giving them a chance to play through the match, or they'd run out of their spawn and get killed immediately.\n\n\nOther than these issues, I would personally recommend playing Black Ops 6, but I'd also like to recommend it if you have decent WiFi at least, since it is an Online Only game for some wild reason. If you are going to give this game a try, I'd say try it on an Xbox Game Pass trial, or play it on a friend's computer/console to see if you like it first. Since this game just came out and has issues like the ones listed above and much more, it's a big hit or miss whether you'd like it or not.",
            "weighted_vote_score": "0.71934199333190918"
        },
        {
            "review": "Same call of duty garbage. Nothing has changed for the better. If you're hoping for a game like cod 4, world at war, or black ops 1 or 2 then don't bother with this game. The multiplayer is a mess with broken spawns. You are constantly spawn flipped and spawned just to be killed by the person that just killed you. SBMM or EOMM is horrible and ruining this game. The zombies isn't bad not black ops 3 zombies by any means. Multiplayer is the same as the last 5 games so don't waste your money.",
            "weighted_vote_score": "0.707582831382751465"
        },
        {
            "review": "Loved the Campaign, have a love/hate relationship with Multiplayer (especially if I'm grinding camos), and I have really enjoyed zombies so far.",
            "weighted_vote_score": "0.691721975803375244"
        },
        {
            "review": "only get this on sale, campaign is way way way too short for 80€\ngame is good. just not worth 80€\n\nzombies is cool except when you lag and the game fucks you by rubberbanding you back into the zombies horde\n\nalso zombies solo (and campaign too?) requires internet",
            "weighted_vote_score": "0.684852302074432373"
        },
        {
            "review": "I can't get a refund because my Warzone play time got added to Black Ops 6. I bought the game on November 30th for the autumn steam sale and played 1 nuke town match, I didn't enjoy it and submitted a refund request. The next day I an email from steam support say that my request was denied because of significant playtime. That led me to feel like I got robbed because of the Warzone playtime. This is my first steam review, hope this helps someone.",
            "weighted_vote_score": "0.679128766059875488"
        },
        {
            "review": "Need to fix the multiplayer maps, its way to easy to spawn camp.\n\nNow they nerf the fun and ignore game breaking bugs.",
            "weighted_vote_score": "0.714574635028839111"
        },
        {
            "review": "Please, take me back to 2009. All these new CoD games become unplayable after just a few months. I hate everything you're doing right now, like selling a $100 DLC instead of a complete game that’ll die out by next year, with SBMM, skill-based damage, terrible maps, snipers getting nerfed every year, and that awful SMG + stimulant meta.\n\nI've lost all faith in multiplayer, and I thought Zombies would be better, but then I saw those ugly elite bosses recycled from MW3. Am I surprised? Of course not; it's just another DLC! And now we only get gold from killing zombies instead of hitting them? No thanks. Not to mention the servers crashing constantly, ruining hours of gameplay for nothing (:\n\nI love how every new CoD feels like a DLC, with all the same issues as the previous games, except skins you guys bought—makes no sense at all.\n\n2009 to 2012 was the golden era, and it’ll never be like that again.\n\nOh yeah, thanks for the human shields instead of executions—fun for about a week.",
            "weighted_vote_score": "0.664389491081237793"
        },
        {
            "review": "Trash optimization, laggy menus, laggier games, cant play offline, crashes, have to restart game 100 times to get shaders to load only for game to look like its in 720, buggy textures, game wont even open after 9 hours and instead of telling me why i get \"Travis-Rilea,\" 18+ cant say no no words, overpriced skins, overpriced game. Ive seen better in Roblox",
            "weighted_vote_score": "0.635235309600830078"
        },
        {
            "review": "DO NOT BUY THIS GAME!!!! Random permanent bans are being placed on accounts for no reason, I wasn’t even on the game when I received an email at work that my account was permanently banned for a violation of the game, I did nothing and was not even on the game for hours when this happened. No one hacked my account and I’ll soon upload a link to a site where proof that no hacking type programs, etc. was on my PC. CALL OF DUTY WILL ALLOW YOU TO SPEND HOURS PLAYING, BUYING PASSES, BUYING THE VAULT EDITION THEN BAN YOU WITH NO HOPE AT ALL OF OVERTURNING THE BAN! I will never in my life touch another activation game. THEY DO NOT DESERVE OUR TIME OR OUR MONEY! DO NOT BUY THIS GAME!!!!",
            "weighted_vote_score": "0.683156907558441162"
        },
        {
            "review": "Note: This Review is Campaign focused.\n\n[b]Rating: [/b] ★★★★★ - Amazing\n[b]Time Played Campaign:[/b] 9.5 hours\n[b]Difficulty:[/b] Hardened\n\n[b]Gameplay:[/b]\n\t• A Sequel to Call of Duty: Cold War with an expansion of the action-packed and fast-paced missions mixed in with a strong emphasis on tactics and stealth.\n\t• New features like upgrading the hub area and spending  cash to earn abilities for missions add depth, allowing different approaches to scenarios.\n\t• Enemies are now varied with improved intelligence and require use of different tactics to take out (Minigunner and Riot Shield).\n\t• Each mission has its own style, constantly modifying how you play to prevent it from feeling too predictable or repetitive.\n\t• Omnidirectional movement feature (Sliding and diving 360) work well in allowing flexibility during a firefight in campaign but are more useful in multiplayer.\n\t\n[b]Story\\Dialogue:[/b]\n\t• Intriguing storyline that delves into covert missions that deem the team an 'enemy of the state', continuing the classic Black Ops theme of conspiracy.\n\t• Characters are well-developed, with returning and new faces that have their own personalities, goals and ambitions.\n\t• Dialogue is intense and well-acted, with some emotionally powerful moments, though a few lines feel overly dramatic and typical.\n\t• Some players may find plot twists predictable, but overall, it keeps you engaged.\n\t\n[b]Graphics\\Music:[/b]\n\t• High-quality graphics with impressive detail in character models, environments, and lighting effects with visually immersive set pieces and diverse settings. The best Call of Duty has looked.\n\t• The soundtrack is powerful, bassy and well-timed.\n\t• Sound design of reloading, shooting and explosions is crisp.\n\t\n[b]Before you Play:[/b]\n\t• Before downloading the game, to reduce the amount of download\\hard drive space on Steam, Go to Call of Duty -> Properties -> DLC and have checked only the modules that you plan on playing.\n\t• While not solidly connected, It'd be worth playing Call of Duty Black Ops 1 and Cold War first, as it's a continuation of the story.\n\t• Make use of the inventory wheel to change out and use your tactical and lethal equipment often, even for ones you don’t think you'll use. Everything comes in handy.\n\t• While not focused in this review, Multiplayer and Zombies are just as fun and you can find yourself spending copious amount of hours playing both with friends.",
            "weighted_vote_score": "0.677662491798400879"
        },
        {
            "review": "horrible season, horrible maps, full of bugs and cringe skins",
            "weighted_vote_score": "0.676547110080718994"
        },
        {
            "review": "Disappointed in this game and treyarch. The game looks like a remake of MW3, which is not surprising, because the engine is the same with the same Directx errors that appear every 5-10 minutes. The engine is 5 years old, and the developers haven’t fixed anything, it’s absurd to buy this product at full price. Worst purchase of my life\n",
            "weighted_vote_score": "0.625126242637634277"
        },
        {
            "review": "Instead of fixing crashes on PC they bring pay function for gums. Are you retarded?\nThank you.",
            "weighted_vote_score": "0.62436223030090332"
        },
        {
            "review": "It’s been a while since I bought a Call of Duty game, and it’s been even longer since I actually enjoyed and played it. The last game I really enjoyed and played a lot was Black Ops 2. After that and up until now I bought 1 more game, and received another one for free and neither of them I played longer than 2 hours. That means that for 12 years I have been kind of disconnected with the franchise. I played some Warzone a couple of years ago, but that’s about it.\n\nWhen Black Ops 6 came closer to launch, it got on my radar and actually looked kind of fun. A lot less jetpack and wall running, and it promised to go back to the good old days of Black ops 1 & 2. I decided to wait until the reviews came out, and they were rather positive, so I decided to give it a go.\n\nLet’s start with the campaign. Even back in the days when I was still playing Black Ops 1 and 2, I never really touched the campaign in COD games. The only campaign I only ever finished before was Modern Warfare 2(2009). Others I played for a couple of missions but always lost interest rather quickly. Maybe because I was younger as well. I must say I really enjoyed the Black Ops 6 campaign! It looks impressive graphically, and the environments are really detailed. The story itself wasn’t the most interesting, but the mix of action, large battles, spy missions and zombies, together with the sound design and detailed environments kept me hooked.\n\nNext, the zombie mode. I’m really enjoying this as well in co-op with a friend. It’s a shame there’s only 2 levels, but they’re both solid maps. There’s a ton of Easter eggs to discover if you like, which can definitely help you get further, but in contrast to some of the zombie modes in recent COD games, here I don’t have the feeling you actually need to know the Easter eggs in order to have fun. All in all, it’s solid. It could use an extra map for sure though.\n\nThen multiplayer. Again, it’s solid. It’s what you expect of an average COD game. I’m glad it’s more boots on the ground than recent years, and it runs smoothly. It has everything you know and love. Solid maps, A good variety of weapons, Perks, Score streaks, Leveling etc. etc. The only real downside here for me is the map size. The maps are fun, but all of them are on the small side. It really lacks some medium-sized maps. Due to the current map size there is little room for gameplay variety, and you’re almost forced to go the run and gun route.\n\nThere is one thing I really need to complain about though. Why the hell did they choose to go the route of bundling multiple COD games into 1 launcher. It makes for an unbelievably bad experience. The UI in the main menus but also in the rest of the game(s) is laggy. and the cycle for when an update is launched is so annoying. Here is a typical flow of starting the campaign after a update:\n\n-Steam downloads a update for Call of Duty\n-You start the game, which starts the COD Hub.\n-The game notifies you a update is installed and needs to be restarted\n-You restart the game\n-You again start the game, which starts the COD Hub again\n-You click on Campaign\n-The game closes and starts the Campaign instance.\n\nWho thought this was a good idea? Not to mention that because everything is merged into one hub, in my library and on my Steam Profile I am missing Call of Duty Black Ops 6. Meaning I cannot go to the store page from my library, and cannot see my individual hours played for a specific Call of Duty game. It’s a really bad system in the way it is now. Not only this, but the COD Hub is bloated. Advertisements for microtransactions and other (not owned) games everywhere. Why do I pay 80 euros and get a launcher full of bloatware, microtransactions and laggy menus?!\n\nOverall though, it's a blast to play a good Call of Duty game again. It’s a bit barebone in content with only 2 zombie maps, a 7-hour campaign and only small multiplayer maps, but the overall package is still solid. The COD Hub is incredibly bad though, it’s a turd on the otherwise good experience of playing this game.",
            "weighted_vote_score": "0.670963108539581299"
        },
        {
            "review": "Not played campaign, but multiplayer is okay, zombies is great\n\n\nBut still, the company behind the franchise is still very much predatory and greedy, they haven't changed and will not change if we don't say anything and forgive them for any good hit they land, this game is cool, but i don't want to give support and let them make another Vanguard or MWIII after this where i'd rather take an acid bath than play the game\n\nSo if you really wanna buy it go ahead, but don't forget this company's end goal : money.\n\nIf we continue to let them go on, YOU will have to pay for a 100 dollar base game made with minimal effort, spend YOUR entire wallet in the shop and battle passes, use lazy and ugly AI generated calling cards/emblems, deal with lousy gunplay and unbalanced maps AND YOU WILL BE EXPECTED TO BE HAPPY.",
            "weighted_vote_score": "0.612752676010131836"
        },
        {
            "review": "Same old song and dance with the yearly release of Call of Duty except you always need an internet connection to play because of texture streaming which has caused multiplayer and zombies to become stutter fests whenever I have any other application open. The gameplay does feel much better than MWII 2022, but the instant slide with a huge speed boost makes engagements more annoying than ever. Multiplayer feels like your normal CoD experience with the new movement systems, but feels somewhat clunky with hits seemingly not registering at times (explained later) as well as hackers already being present due to the reusing of the same engine/code as previous years and the SBMM feeling as garbage as usual. Zombies is fun and I'm somewhat hopefully for the future of it as a long time fan and enjoyer of Cold War. However, the constant internet connection needed for SOLO games causes those to feel wrong with damage taking a moment to register as it has to verify it with the server. This necessary verification can cause: shots not to register, players to teleport around, and overall create a gameplay experience that does not feel quite right after some time playing. This same thing is present in multiplayer as well, but is more understandable since that is an actual multiplayer environment though it does not feel good there as feel with shots not registering and the game telling you how many shots the opponent hit on you but not how much you hit on them. Campaign is a fun experience, but most players are going to gloss over it after seeing a playthrough elsewhere or after their first time through.\n\nOverall, I cannot recommend this and wish I didn't fall into the hype behind it. I can't see the series going in any other direction other than the one they are going in now and don't plan on continuing the vicious cycle of the yearly CoD cycle. I think I'm done after this one.",
            "weighted_vote_score": "0.606882870197296143"
        },
        {
            "review": "Well its official, I am done with CoD. The multiplayer is an absolute shit show. Core has the worst TTK of any CoD ever released. Hardcore someone negates this issue, but it doesn't really matter since the maps are trash and also way too easy for rounds to be blowouts due to spawn camping. The campaign was good, but at this point the story has wrapped up enough that for future games their is no point in bothering anymore. Zombies is the only real worthwhile aspect of this game, and even that doesn't justify the price tag and dog shit predatory practices CoD has morphed into over the years.",
            "weighted_vote_score": "0.600037038326263428"
        },
        {
            "review": "Cod used to be fun. I have been playing cod for over a decade and i could play for hours but these new cods are too fast. too chaotic and not fun at all. especially because of matchmaking and omni movements. and maps are horrible.",
            "weighted_vote_score": "0.60000002384185791"
        },
        {
            "review": "I like zombs :D campaign is a different case, multiplayer fun until sbmm then rage switch to zombs then die high round and go back to multiplayer. The cycle never ends. help",
            "weighted_vote_score": "0.590768516063690186"
        },
        {
            "review": "One of the most fun zombies and multiplayer experiences in years.\n\nI'm not much of a campaign player but the Black Ops 6 campaign has been incredibly fun with moments of classic COD shootouts, stealth missions and even zombies crossover.\n\n10/10",
            "weighted_vote_score": "0.590683102607727051"
        },
        {
            "review": "the game hasnt even been out for a month and theyve already started the destroy it.\n\nbuy the battle pass to get a new gun\nif you do not buy the battle pass after every single game youre hammered with purchase the battle pass to get X reward\n\nthe shop is shoved in your face whenever you enter the game.\n\nskill based damage ~ terrible idea sack the person who thought of this\nskill based match making ~ terrible idea sack the person who thought of this\n\nstill haven't fixed the spawn issues since the alpha\nstill haven't fixed the camera bug in play of the game been around since the beta\nstill haven't fixed the vault edition issue of not receiving the items\n\nno option for profanity filter may as well rate this game as pg\n\ncampaign is lack-luster and has no resolution, surprise surprise the game shoves political and sexual identity down your throat. who saw it coming? everyone\n \n\nwhats good about it? \n\nabsolutly nothing, menu simulator, the devs want you to do anything but play the game and spend time looking through their shop. like this is a joke at this point fix your fucking game. stop wasting our time with dumb shop items targeted at sexually confused teens, this has to stop. \n\nDO NOT PURCHASE THIS GAME",
            "weighted_vote_score": "0.58638685941696167"
        },
        {
            "review": "Game crashes constantly. Keep getting suspensions on ranked play because it crashes mid game.\n\nMost unreliable game I have ever owned. \n\n",
            "weighted_vote_score": "0.585673272609710693"
        },
        {
            "review": "Worst servers of any game so far.. The lagging is horrible. A lot of us paid for a game that we can't even enjoy.",
            "weighted_vote_score": "0.585645139217376709"
        },
        {
            "review": "Shadow banned for nothing. Do not buy this game it is a waste of money. If you do anything above average you will get reported and stuck into a shadow ban loop with no way out and not being able to play the game. Please do not buy this.",
            "weighted_vote_score": "0.583333313465118408"
        },
        {
            "review": "like most cods recently this game is shit the zombies is the only good thing about it and its mid. cod continues to rely on skins and weapon mods to keep their game going meanwhile you spawn in each others assholes for multiplayer. hay cod we all love shipment doesnt mean every fucking map needs to be that fucking small. what is the point of having snipers if you dont make maps big enough to snip on. yall as devs have gotten so fucking lazy and im getting a refund casue this is the last cod i will be getting. yall refuse to put a range of map sizes on multiplayer like you use to and got lazt and depend on warzone for that (which is also shit). got back to the basics",
            "weighted_vote_score": "0.58077394962310791"
        },
        {
            "review": "Skill Based Damage is real.\nGrenades get deflected, guns get nerfed, enemies become bullet sponges, aim assist gets tweaked- all in the middle of a match just so certain players can \"feel\" like they're doing better, for player retainment.\n\nBright and obnoxious bundles are the new norm. Worse than any other CoD I've played in that aspect. What does a bright green neon dragon have to do with Black Ops? And why the hell does it cost $20?\nIt wouldn't be so bad if the tracers and death effects weren't literally blinding.\n\nSo not only have you started rising the price of your game by $10, you're also actively rigging the multiplayer game mechanics and hoing us with these garbage bundles?\nYeah no thanks.\n\nNo wonder you poured a bunch of nostalgia bait into this game.",
            "weighted_vote_score": "0.578813016414642334"
        },
        {
            "review": "Some of the worst maps mixed with the worst spawns in CoD history, you will spawn 2 feet in front of an enemy that's already aiming at you.",
            "weighted_vote_score": "0.574231147766113281"
        },
        {
            "review": "This game sucks.... hackers everywhere,manipulating sbmm, games already losing players, the maps suck balls, and the game itself sucks balls.",
            "weighted_vote_score": "0.573128044605255127"
        },
        {
            "review": "Probably the most fun I've had playing zombies in a while the multiplayer is good but there are occasionally some sweats or You Tubers trying to get clips which can be annoying. 8/10",
            "weighted_vote_score": "0.572279155254364014"
        }
    ],
    "620": [
        {
            "review": "Life-changing, first proper story game I've played and a damn good one to start with, couldn't recommend more if i tried.",
            "weighted_vote_score": "0.659220635890960693"
        },
        {
            "review": "From the moment you start the game, you're greeted with a vibrant and colorful environment to explore. The game's setting is a mysterious research facility, and you play as Chell, a test subject who's been awakened from stasis to find that the facility has been overrun by decay and neglect.\r\n\r\nThe gameplay is a blend of physics-based puzzles and platforming, with a variety of challenges that will test your problem-solving skills and reflexes. You'll need to use the portal gun to create portals on surfaces, allowing you to teleport between them and manipulate the environment to your advantage. But that's just the beginning - the game introduces new mechanics such as gels that can change the properties of surfaces, and lasers that can be redirected and focused.\r\n\r\nBut Portal 2 isn't just about solving puzzles. The game's witty humor and deep narrative are also highlights, with a memorable cast of characters including Wheatley, a personality core with a mind of his own, and GLaDOS, the malevolent AI from the first game. The game's story is more fleshed out than the first, with a surprising twist that will leave you questioning the nature of reality.\r\n\r\nAnd for those who enjoy a more challenging experience, the game's difficulty curve is steep, with tough puzzles that will test your skills as a gamer.\r\n\r\nThe game's physics engine is also a highlight, with realistic physics and environmental interactions that make every encounter feel unique. You can use the game's physics to your advantage, such as using portals to redirect lasers or manipulate momentum.\r\n\r\nSo if you're a fan of puzzle-platformers and want a mind-bending adventure that takes everything that made the first game great and expands upon it, then Portal 2 is the game for you. With its vibrant and colorful environment, challenging gameplay, and engaging story, this game is a must-play for any fan of the genre. Just be prepared for a thrilling and sometimes intense journey into a world where nothing is as it seems.",
            "weighted_vote_score": "0.655172407627105713"
        },
        {
            "review": "If you thought Portal was good, wait til you try Portal 2, it's a masterpiece. From the lore to the voice acting, the choices Valve makes to make these games is incredible. Solid 10/10. One of the great classics.",
            "weighted_vote_score": "0.624028980731964111"
        },
        {
            "review": "Portal 2 expanded upon that perfect formula of portal 1 into something even greater. The gameplay is silky-smooth and intuitive, and the feeling of freedom in solving problems is both satisfying and very rewarding. \n\nThe way the game introduces and teaches you to master the new mechanics, like the propulsion and repulsion gels, is brilliant, layering each concept naturally into the puzzles without ever feeling overwhelming. \n\nIn this game especially, the story, voice acting, and atmosphere take center stage, masterfully binding it all into a perfect experience of humor, wit, and innovation. \n\nand it has alot of content both a great single player mode and the co-op mode i have yet to experience it again as i've played the co-op mode before on console. and how can we forget about the great community of portal 2 workshop.\n\nPortal 2 is not just a game; this is a timeless work of art. i 100% recommend this game also worth the price.",
            "weighted_vote_score": "0.556485354900360107"
        },
        {
            "review": "\"Portal 2 is a masterpiece of puzzles that combines clever mechanics and an exciting storyline. The game immerses you into a world of exciting challenges with portal technologies, forcing you to think outside the box. Wonderful humor and charismatic characters make every minute unforgettable. A must-pass for all fans of intellectual games!\"\n\n\n\n\"Portal 2 — это шедевр головоломок, который сочетает в себе умные механики и захватывающий сюжет. Игра погружает в мир увлекательных испытаний с портальными технологиями, заставляя думать нестандартно. Прекрасный юмор и харизматичные персонажи делают каждую минуту незабываемой. Обязательно к прохождению для всех любителей интеллектуальных игр!\"",
            "weighted_vote_score": "0.525862038135528564"
        },
        {
            "review": "Portal 2 is really fun. I like every fundamental aspect of the game from the funny dialogue to the challenging puzzles. The game is really innovative too. I recommend this game to everyone looking for a challenging but fun gaming experience and and to everyone looking for something different.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "This game is a true masterpiece noway, bruh\nGameplay 12/10\nScript 1337/10\nVibe 999/10\nAny game from my library never made me cry, like the bundle of Portal.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "What is there to say, great puzzle game and great story. All around great game",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Still a very nice game despite it being 13 years old, comedy is gold and voice acting is marvelous. (Love the name of the last chapter) Potato/10",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Improves on the first game in basically every way. Longer more complex story, more unique/creative mechanics, and more interesting environments. It is also more difficult than the first, requiring a bit more thinking but because of that its more satisfying when completing the puzzles.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "It's very rare that I replay a story-driven game, because I never feel the same way as I did on the first playthrough. Portal 2 is an exception.\r\n\r\nThe environments, the characters, the writing, it's all so good. Even though I know the solutions to most of the puzzles by heart, I still keep coming back. At the time of writing, I've played through about five times. Every time I start the game up, it feels like coming home to an old friend. It's such a great stress-reliever as well. And yes, I always tear up a little bit at the end.\r\n\r\n10/10, one of my favourite games.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "Literally one of the best games of all time. It's witty, so interesting, and a real head-scratcher at times! The mechanics are perfectly thought out and balanced to the extreme. If you haven't played either Portal game yet, you are truly missing out.",
            "weighted_vote_score": "0.523809552192687988"
        },
        {
            "review": "I loved playing this game! Compared to the original portal game, Portal 2 has a great use of comedy, and a much more intricate and complex story line. The game play mechanics are also incredibly clever.",
            "weighted_vote_score": "0.52173912525177002"
        },
        {
            "review": "For a game that came way back in 2011, This well worth your time! Puzzle is engaging sometimes easy sometimes hard (and then when you realize, its actually easy but you keep thinking way to hard for it but in actuality its a solution obviously in front of you LOL), 11/10 I wish we have more games like this nowadays, or maybe Portal Thr--, *beeeps*",
            "weighted_vote_score": "0.512820541858673096"
        },
        {
            "review": "I am the worst at puzzle games. I kid you not I when it comes to puzzle games I suddenly turn into a monkey who just randomly jumps around a clicks on thing hoping the riddle will solve itself. But I still love Portal. Sure, one puzzle takes me 30 minutes but I love it. The dialogue in this game contains some of the funniest lines in any game that I have played. The puzzles are fun, smart, and everytime you finish one, you get satisfaction that can almost be compared to an orgasm. \n",
            "weighted_vote_score": "0.502262413501739502"
        }
    ]
}